% lw2_1.m
run('../1/lw1_params.m'); % Завантаження A, B, G з 1-ї лаби

Qc = ctrb(A, B);
rank_Qc = rank(Qc);

fprintf('Ранг матриці керованості: %d\n', rank_Qc);
if rank_Qc == size(A, 1)
    disp('Система повністю керована.');
else
    disp('Система некерована!');
end

w0 = 30;
% Поліном Батерворта 4-го порядку:
des_coeffs = [1, 2.6*w0, 3.4*w0^2, 2.6*w0^3, w0^4];
des_poles = roots(des_coeffs);

% Розрахунок матриці H (формула Аккермана)
H = acker(A, B, des_poles); 

disp('Бажані полюси:');
disp(des_poles);

disp('Розрахована матриця регулятора H:');
disp(H);

% 3. Перевірка коренів замкненої системи
A_new = A - B*H; 
closed_loop_poles = eig(A_new);

disp('Полюси замкненої системи (перевірка):');
disp(closed_loop_poles);

% Ранг матриці керованості: 4
% Система повністю керована.
% Бажані полюси:
%  -11.4223 +27.7404i
%  -11.4223 -27.7404i
%  -27.5777 +11.8097i
%  -27.5777 -11.8097i
% Розрахована матриця регулятора H:
%    1.0e+05 *
%     0.1971    1.8404    0.1324   -1.7523
% Полюси замкненої системи (перевірка):
%  -11.4223 +27.7404i
%  -11.4223 -27.7404i
%  -27.5777 +11.8097i
%  -27.5777 -11.8097i